In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [5]:
!pip install sqlalchemy psycopg2-binary

Requirement already satisfied: sqlalchemy in /Users/rachel/opt/anaconda3/lib/python3.8/site-packages (1.4.7)
Collecting psycopg2-binary
  Using cached psycopg2_binary-2.9.9-cp38-cp38-macosx_10_9_x86_64.whl (2.8 MB)
Requirement already satisfied: greenlet!=0.4.17 in /Users/rachel/opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.9

In [17]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [20]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,yellow_tripdata_trip,root,None,False,False,False,False

#### Read NYC Taxi Data and load into Postgres

In [30]:
df = pd.read_csv('green_tripdata_2019-09.csv.gz')
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
df.head(2)

/Users/rachel/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

# Drop the table 
drop_query = "DROP TABLE IF EXISTS yellow_tripdata_trip;"
engine.execute(drop_query)

In [34]:
df.to_sql(name='green_tripdata_trip', con=engine, index=False)

#### Queries for homework

In [35]:
query = """
SELECT * FROM green_tripdata_trip LIMIT 10
"""

pd.read_sql(query, con=engine)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-09-01 00:10:53,2019-09-01 00:23:46,N,1.0,65,189,5.0,2.00,10.5,0.5,0.5,2.36,0.00,None,0.3,14.16,1.0,1.0,0.0
1,2.0,2019-09-01 00:31:22,2019-09-01 00:44:37,N,1.0,97,225,5.0,3.20,12.0,0.5,0.5,0.00,0.00,None,0.3,13.30,2.0,1.0,0.0
2,2.0,2019-09-01 00:50:24,2019-09-01 01:03:20,N,1.0,37,61,5.0,2.99,12.0,0.5,0.5,0.00,0.00,None,0.3,13.30,2.0,1.0,0.0
3,2.0,2019-09-01 00:27:06,2019-09-01 00:33:22,N,1.0,145,112,1.0,1.73,7.5,0.5,0.5,1.50,0.00,None,0.3,10.30,1.0,1.0,0.0
4,2.0,2019-09-01 00:43:23,2019-09-01 00:59:54,N,1.0,112,198,1.0,3.42,14.0,0.5,0.5,3.06,0.00,None,0.3,18.36,1.0,1.0,0.0
5,2.0,2019-09-01 00:55:37,2019-09-01 01:17:02,N,1.0,7,41,1.0,6.26,21.0,0.5,0.5,0.00,6.12,None,0.3,28.42,2.0,1.0,0.0
6,2.0,2019-09-01 00:28:55,2019-09-01 00:52:09,N,1.0,33,37,1.0,4.34,18.0,0.5,0.5,3.86,0.00,None,0.3,23.16,1.0,1.0,0.0
7,1.0,2019-09-01 00:03:13,2019-09-01 00:03:32,N,1.0,55,55,1.0,1.20,2.5,0.5,0.5,0.00,0.00,None,0.3,3.80,3.0,1.0,0.0
8,1.0,2019-09-01 00:15:28,2019-09-01 00:43:22,N,1.0,55,89,1.0,0.00,22.2,0.0,0.5,0.00,0.00,None,0.3,23.00,1.0,1.0,0.0
9,2.0,2019-09-01 00:29:16,2019-09-01 00:30:15,N,1.0,17,17,1.0,0.14,2.5,0.5,0.5,0.00,0.00,None,0.3,3.80,2.0,1.0,0.0

#### Question 3:  Count Records

In [39]:
# number of taxi trips made on September 18th 2019 - pick up and drop off on the same day

query = """
SELECT COUNT(*) FROM green_tripdata_trip
WHERE lpep_pickup_datetime BETWEEN '2019-09-18 00:00:00' AND '2019-09-18 23:59:59'
AND lpep_dropoff_datetime BETWEEN '2019-09-18 00:00:00' AND '2019-09-18 23:59:59'
;
"""

pd.read_sql(query, con=engine)

   count
0  15612

#### Question 4: Largest trip for each day

In [46]:
# longest trip for each day

query = """
SELECT lpep_pickup_datetime, trip_distance, lpep_dropoff_datetime - lpep_pickup_datetime AS trip_duration
FROM green_tripdata_trip
ORDER BY trip_distance DESC
LIMIT 10
;
"""

pd.read_sql(query, con=engine)

  lpep_pickup_datetime  trip_distance   trip_duration
0  2019-09-26 19:32:52         341.64 0 days 06:17:35
1  2019-09-21 00:18:15         135.53 0 days 03:19:58
2  2019-09-16 07:17:37         114.30 0 days 02:13:26
3  2019-09-28 03:30:40          89.64 0 days 02:36:00
4  2019-09-24 01:16:42          82.12 0 days 02:21:12
5  2019-09-18 18:20:00          70.28 0 days 00:41:00
6  2019-09-10 06:49:56          69.67 0 days 01:20:10
7  2019-09-27 17:51:39          68.41 0 days 01:40:56
8  2019-09-28 01:21:42          67.20 0 days 01:51:19
9  2019-09-02 03:56:18          61.69 0 days 01:19:33

#### Question 5: Top 3 Pick Up by Boroughs
Read in taxi zone look up table

In [48]:
# read in zone info
zone = pd.read_csv('taxi+_zone_lookup.csv')
zone.to_sql(name='taxi_zone_lookup', con=engine, index=False)
zone.head(2)

   LocationID Borough            Zone service_zone
0           1     EWR  Newark Airport          EWR
1           2  Queens     Jamaica Bay    Boro Zone

In [79]:
# Boroughs with the most pick ups - total amount

query = """
SELECT *
FROM taxi_zone_lookup t
WHERE t."Zone" = 'Astoria'
;
"""

pd.read_sql(query, con=engine)

   LocationID Borough     Zone service_zone
0           7  Queens  Astoria    Boro Zone

In [74]:
# Boroughs with the most pick ups - total amount

query = """
SELECT t."Borough", SUM(total_amount) AS TOTAL_AMOUNT
FROM green_tripdata_trip as tp
LEFT JOIN
taxi_zone_lookup AS t
ON tp."PULocationID" = t."LocationID"
WHERE lpep_pickup_datetime BETWEEN '2019-09-18 00:00:00' AND '2019-09-18 23:59:59'
AND lpep_dropoff_datetime BETWEEN '2019-09-18 00:00:00' AND '2019-09-18 23:59:59'
AND t."Borough" != 'Unknown'
GROUP BY t."Borough"
ORDER BY TOTAL_AMOUNT DESC
;
"""

pd.read_sql(query, con=engine)

         Borough  total_amount
0       Brooklyn      94766.66
1      Manhattan      91460.54
2         Queens      77810.41
3          Bronx      32452.46
4  Staten Island        342.59

#### Question 6: Largest Tip

In [89]:
# For the passengers picked up in September 2019 in the zone name Astoria which was the drop off zone that had the largest tip? 
# We want the name of the zone, not the id
query = """
SELECT tpu."Zone" AS PUzone, tdo."Zone" AS DOzone, tip_amount
FROM green_tripdata_trip as tp
LEFT JOIN
taxi_zone_lookup AS tpu
ON tp."PULocationID" = tpu."LocationID"
LEFT JOIN
taxi_zone_lookup AS tdo
ON tp."DOLocationID" = tdo."LocationID"
WHERE tpu."Zone" = 'Astoria'
ORDER BY tip_amount DESC
;
"""

pd.read_sql(query, con=engine)

        puzone                          dozone  tip_amount
0      Astoria                     JFK Airport       62.31
1      Astoria                        Woodside       30.00
2      Astoria                        Kips Bay       28.00
3      Astoria                              NV       25.00
4      Astoria           Upper West Side South       20.00
...        ...                             ...         ...
18274  Astoria                        Steinway        0.00
18275  Astoria         Queensbridge/Ravenswood        0.00
18276  Astoria                        Steinway        0.00
18277  Astoria                         Astoria        0.00
18278  Astoria  Long Island City/Hunters Point        0.00

[18279 rows x 3 columns]